In [1]:
!pip install mysql-connector

Requirement already satisfied: mysql-connector in c:\users\pc\anaconda3\lib\site-packages (2.2.9)

In [5]:
import mysql.connector
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "firstone"
)
db = database.cursor()

In [34]:
sql = "SELECT * FROM student"
db.execute(sql)
result = db.fetchall()
result

[(1, 'Ram', 87, 65, 55, 44, 66, 770, 67.8, 'A'),
 (2, 'Ja', 55, 44, 98, 67, 45, 607, 67.0, 'B'),
 (3, 'Zaza', 55, 66, 77, 88, 98, 600, 78.0, 'A'),
 (4, 'Shiv', 67, 66, 77, 88, 45, 900, 78.0, 'A'),
 (5, 'Hari', 87, 84, 99, 67, 98, 607, 67.0, 'B'),
 (6, 'Messi', 67, 76, 88, 80, 76, 900, 81.0, 'A'),
 (7, 'Shiv', 76, 86, 78, 78, 45, 790, 78.0, 'A'),
 (8, 'karim', 83, 82, 85, 76, 76, 822, 82.0, 'A'),
 (9, 'Zidan', 55, 66, 88, 78, 66, 607, 67.0, 'B'),
 (10, 'Zidan', 55, 66, 88, 78, 66, 607, 67.0, 'B'),
 (11, 'Zidan', 55, 66, 88, 78, 66, 607, 67.0, 'B'),
 (12, 'we', 44, 55, 66, 77, 88, 2147483647, 891134000.0, 'A'),
 (13, 'rr', 55, 66, 44, 55, 66, 2147483647, 1113290000.0, 'A'),
 (14, 'tt', 55, 66, 77, 88, 55, 341, 68.2, 'B')]

In [8]:
sql = "SELECT * FROM student WHERE grade = 'A'"
db.execute(sql)
result = db.fetchall()
result

[(1, 'Ram', 87, 65, 55, 44, 66, 770, 67.8, 'A'),
 (3, 'Zaza', 55, 66, 77, 88, 98, 600, 78.0, 'A'),
 (4, 'Shiv', 67, 66, 77, 88, 45, 900, 78.0, 'A'),
 (6, 'Messi', 67, 76, 88, 80, 76, 900, 81.0, 'A'),
 (7, 'Shiv', 76, 86, 78, 78, 45, 790, 78.0, 'A'),
 (8, 'karim', 83, 82, 85, 76, 76, 822, 82.0, 'A')]

In [18]:
sql = '''INSERT INTO student (S No., Name, Physics, chemistry, math, english, nepali, toal, percentage, Grade) 
VALUES ('Nilan', 55, 66, 88, 78, 66, 607, 67, 'B')'''
db.execute(sql)
database.commit()

ProgrammingError: 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near 'No., Name, Physics, chemistry, math, english, nepali, toal, percentage, Grade...' at line 1

In [33]:
name = input("Enter name =")
Physics = int(input("Enter Physics ="))
chemistry = int(input("Enter chemistry ="))
math = int(input("Enter math ="))
english = int(input("Enter english ="))
nepali = int(input("Enter nepali ="))
total =Physics+chemistry+math+english+nepali
percentage = total/5
if percentage >= 80:
    grade = 'A'
elif percentage >= 60:
    grade = 'B'
elif percentage >= '45':
    grade = 'C'
else:
    grade = 'F'
    
sql = f'''INSERT INTO student(`Name`, `Physics`, `chemistry`, `math`, `english`, `nepali`, `toal`, `percentage`, `Grade`) 
VALUES ('{name}','{Physics}','{chemistry}','{math}','{english}','{nepali}','{total}','{percentage}','{grade}')'''
db.execute(sql)
database.commit()

Enter name =tt
Enter Physics =55
Enter chemistry =66
Enter math =77
Enter english =88
Enter nepali =55

In [ ]:
name = input('Enter name = ')
sn = int(input("Ehter sn = "))
sql = f'''UPDATE student SET Name = '{name}', S No. = 'sn'

In [ ]:
UPDATE `student` SET `S No.`='[value-1]',`Name`='[value-2]',`Physics`='[value-3]',